In [1]:
# Load and activate the SQL extension to allow us to execute SQL in a Jupyter notebook.
%load_ext sql

##connecting to local dadabase
%sql mysql+pymysql://root:Password123@localhost:3306/united_nations

## checking data types

In [10]:
%%sql

SHOW
    COLUMNS
FROM
    united_nations.Access_to_Basic_Services;

 * mysql+pymysql://root:***@localhost:3306/united_nations
10 rows affected.

[('Region', 'varchar(32)', 'YES', '', None, ''),
 ('Sub_region', 'varchar(25)', 'YES', '', None, ''),
 ('Country_name', 'varchar(37)', 'NO', '', None, ''),
 ('Time_period', 'int', 'NO', '', None, ''),
 ('Pct_managed_drinking_water_services', 'decimal(5,2)', 'YES', '', None, ''),
 ('Pct_managed_sanitation_services', 'decimal(5,2)', 'YES', '', None, ''),
 ('Est_population_in_millions', 'decimal(11,6)', 'YES', '', None, ''),
 ('Est_gdp_in_billions', 'decimal(8,2)', 'YES', '', None, ''),
 ('Land_area', 'decimal(10,2)', 'YES', '', None, ''),
 ('Pct_unemployment', 'decimal(5,2)', 'YES', '', None, '')]

## selecting all unique country names from the table

In [16]:
%%sql

SELECT
	Distinct Country_name
FROM
	united_nations.Access_to_Basic_Services
WHERE
	Country_name LIKE '%(%)%';

 * mysql+pymysql://root:***@localhost:3306/united_nations
7 rows affected.

[('Iran (Islamic Republic of)',),
 ('Saint Martin (French Part)',),
 ('Sint Maarten (Dutch part)',),
 ('Bolivia (Plurinational State of)',),
 ('Falkland Islands (Malvinas)',),
 ('Venezuela (Bolivarian Republic of)',),
 ('Micronesia (Federated States of)',)]

## Extract country names without the information inside the parenthesis

In [24]:
%%sql

SELECT
    DISTINCT Country_name,
    LEFT(Country_name, POSITION('(' in Country_name)) AS New_country_name,
    LENGTH(LEFT(Country_name, POSITION('(' in Country_name))) AS New_country_name_length 
FROM
    Access_to_Basic_Services
WHERE
    Country_name LIKE '%(%)%';

 * mysql+pymysql://root:***@localhost:3306/united_nations
7 rows affected.

[('Iran (Islamic Republic of)', 'Iran (', 6),
 ('Saint Martin (French Part)', 'Saint Martin (', 14),
 ('Sint Maarten (Dutch part)', 'Sint Maarten (', 14),
 ('Bolivia (Plurinational State of)', 'Bolivia (', 9),
 ('Falkland Islands (Malvinas)', 'Falkland Islands (', 18),
 ('Venezuela (Bolivarian Republic of)', 'Venezuela (', 11),
 ('Micronesia (Federated States of)', 'Micronesia (', 12)]

##  Identifying any extra characters

In [32]:
%%sql

SELECT DISTINCT
    Country_name,
    RTRIM(LEFT(Country_name, POSITION('(' in Country_name)-1)) AS New_country_name,
    LENGTH(RTRIM(LEFT(Country_name, POSITION('(' in Country_name)-1))) AS New_country_name_length 
FROM
    Access_to_Basic_Services
WHERE
    Country_name LIKE '%(%)%';

 * mysql+pymysql://root:***@localhost:3306/united_nations
7 rows affected.

[('Iran (Islamic Republic of)', 'Iran', 4),
 ('Saint Martin (French Part)', 'Saint Martin', 12),
 ('Sint Maarten (Dutch part)', 'Sint Maarten', 12),
 ('Bolivia (Plurinational State of)', 'Bolivia', 7),
 ('Falkland Islands (Malvinas)', 'Falkland Islands', 16),
 ('Venezuela (Bolivarian Republic of)', 'Venezuela', 9),
 ('Micronesia (Federated States of)', 'Micronesia', 10)]